status/src/2022/0311.org
#+TITLE: 05 March 2022 - 04 March 2022

* MIT OCW
** 18.02 - Multiple Variable Calculus
*** Sessions 36-38/PS5
** 8.01X+8.01L - Physics I - Classical Mechanics with Labs
*** Part 1,PS1 done
** 21G.701 Spanish
*** Finished Episodes 17-18
* Datasheet template
**  Finally found paragraph formatting bug.
  Mostly shooting myself in the foot. Should know better than to mix
  TeX and Latex code.
* Barely Working Math, Science, and Engineering Handbook
**  Various more updates.
* Mill Controller #2
** Potential for using old Compaq iPaq boards.
** May use OLPC in the meantime.
** Still having problems with mill controller booting reliably.
   Probably needs a new RTC battery, too.
* OLPC
** Needs ML1120 coin batteries to fix "invalid system date".
* Part Numbers
  Wasted some time looking into this. Essentially the problem boils
  down to how to mark artifacts in such a was as to identify the
  design. Current part number system is too cumbersome for this
  purpose.
* Virtual Orchestra
  Still trying to decide if this is something worth pursuing. Publicly
  available sample libraries are not complete enough to recreate works
  like Ravel's "Bolero" or Varese's "Ionization".
* Quilting Frame Desk
** Special edge-banding biscuits split.
* Space Missions
  Figured out right page. DONE.
* David Davies
** Broadcom BCG? Employee indicted for running a brothel.
** New case C1923172, consolidated with *15* Parties.
** Next hearing 4/5/2022.
* Peter Kim
** Broadcom CSG Employee indicted for trade secret theft.
** United States v. Kim (5:21-cr-00438).
** Change of Plea Hearing set for 5/31/2022

