status/2022/0311.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-28 Sat 04:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>05 March 2022 - 11 March 2022</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">05 March 2022 - 11 March 2022</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0df59b5">1. MIT OCW</a>
<ul>
<li><a href="#org727f071">1.1. 18.02 - Multiple Variable Calculus</a>
<ul>
<li><a href="#org6e9cf41">1.1.1. Sessions 36-38/PS5</a></li>
</ul>
</li>
<li><a href="#org55b550a">1.2. 8.01X+8.01L - Physics I - Classical Mechanics with Labs</a>
<ul>
<li><a href="#orgad310e7">1.2.1. Part 1,PS1 done</a></li>
</ul>
</li>
<li><a href="#orgfdc1bd2">1.3. 21G.701 Spanish</a>
<ul>
<li><a href="#orgf4e5eea">1.3.1. Finished Episodes 17-18</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org937c75b">2. Datasheet template</a>
<ul>
<li><a href="#orge440545">2.1. Finally found paragraph formatting bug.</a></li>
</ul>
</li>
<li><a href="#orgc7d1c03">3. Barely Working Math, Science, and Engineering Handbook</a>
<ul>
<li><a href="#org59b68fb">3.1. Various more updates.</a></li>
</ul>
</li>
<li><a href="#org437ecaa">4. Mill Controller #2</a>
<ul>
<li><a href="#org164a9b9">4.1. Potential for using old Compaq iPaq boards.</a></li>
<li><a href="#org0483f66">4.2. May use OLPC in the meantime.</a></li>
<li><a href="#org2b32630">4.3. Still having problems with mill controller booting reliably.</a></li>
</ul>
</li>
<li><a href="#org01640e3">5. OLPC</a>
<ul>
<li><a href="#org8eb6091">5.1. Needs ML1120 coin batteries to fix "invalid system date".</a></li>
</ul>
</li>
<li><a href="#orgc800335">6. Part Numbers</a></li>
<li><a href="#orgc7cf5f7">7. Virtual Orchestra</a></li>
<li><a href="#org0078742">8. Quilting Frame Desk</a>
<ul>
<li><a href="#org6fe9557">8.1. Special edge-banding biscuits split.</a></li>
</ul>
</li>
<li><a href="#orgced6ecf">9. Space Missions</a></li>
<li><a href="#orgf3812ed">10. David Davies</a>
<ul>
<li><a href="#orge956d94">10.1. Broadcom BCG? Employee indicted for running a brothel.</a></li>
<li><a href="#org36429e9">10.2. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#org99cc41f">10.3. Next hearing 4/5/2022.</a></li>
</ul>
</li>
<li><a href="#orgc505b11">11. Peter Kim</a>
<ul>
<li><a href="#org57dd61f">11.1. Broadcom CSG Employee indicted for trade secret theft.</a></li>
<li><a href="#orga3a54ee">11.2. United States v. Kim (5:21-cr-00438).</a></li>
<li><a href="#org4e3d560">11.3. Change of Plea Hearing set for 5/31/2022</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org0df59b5" class="outline-2">
<h2 id="org0df59b5"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org727f071" class="outline-3">
<h3 id="org727f071"><span class="section-number-3">1.1.</span> 18.02 - Multiple Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org6e9cf41" class="outline-4">
<h4 id="org6e9cf41"><span class="section-number-4">1.1.1.</span> Sessions 36-38/PS5</h4>
</div>
</div>
<div id="outline-container-org55b550a" class="outline-3">
<h3 id="org55b550a"><span class="section-number-3">1.2.</span> 8.01X+8.01L - Physics I - Classical Mechanics with Labs</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgad310e7" class="outline-4">
<h4 id="orgad310e7"><span class="section-number-4">1.2.1.</span> Part 1,PS1 done</h4>
</div>
</div>
<div id="outline-container-orgfdc1bd2" class="outline-3">
<h3 id="orgfdc1bd2"><span class="section-number-3">1.3.</span> 21G.701 Spanish</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orgf4e5eea" class="outline-4">
<h4 id="orgf4e5eea"><span class="section-number-4">1.3.1.</span> Finished Episodes 17-18</h4>
</div>
</div>
</div>
<div id="outline-container-org937c75b" class="outline-2">
<h2 id="org937c75b"><span class="section-number-2">2.</span> Datasheet template</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orge440545" class="outline-3">
<h3 id="orge440545"><span class="section-number-3">2.1.</span> Finally found paragraph formatting bug.</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Mostly shooting myself in the foot. Should know better than to mix
TeX and Latex code.
</p>
</div>
</div>
</div>
<div id="outline-container-orgc7d1c03" class="outline-2">
<h2 id="orgc7d1c03"><span class="section-number-2">3.</span> Barely Working Math, Science, and Engineering Handbook</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org59b68fb" class="outline-3">
<h3 id="org59b68fb"><span class="section-number-3">3.1.</span> Various more updates.</h3>
</div>
</div>
<div id="outline-container-org437ecaa" class="outline-2">
<h2 id="org437ecaa"><span class="section-number-2">4.</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org164a9b9" class="outline-3">
<h3 id="org164a9b9"><span class="section-number-3">4.1.</span> Potential for using old Compaq iPaq boards.</h3>
</div>
<div id="outline-container-org0483f66" class="outline-3">
<h3 id="org0483f66"><span class="section-number-3">4.2.</span> May use OLPC in the meantime.</h3>
</div>
<div id="outline-container-org2b32630" class="outline-3">
<h3 id="org2b32630"><span class="section-number-3">4.3.</span> Still having problems with mill controller booting reliably.</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Probably needs a new RTC battery, too.
</p>
</div>
</div>
</div>
<div id="outline-container-org01640e3" class="outline-2">
<h2 id="org01640e3"><span class="section-number-2">5.</span> OLPC</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org8eb6091" class="outline-3">
<h3 id="org8eb6091"><span class="section-number-3">5.1.</span> Needs ML1120 coin batteries to fix "invalid system date".</h3>
</div>
</div>
<div id="outline-container-orgc800335" class="outline-2">
<h2 id="orgc800335"><span class="section-number-2">6.</span> Part Numbers</h2>
<div class="outline-text-2" id="text-6">
<p>
Wasted some time looking into this. Essentially the problem boils
down to how to mark artifacts in such a was as to identify the
design. Current part number system is too cumbersome for this
purpose.
</p>
</div>
</div>
<div id="outline-container-orgc7cf5f7" class="outline-2">
<h2 id="orgc7cf5f7"><span class="section-number-2">7.</span> Virtual Orchestra</h2>
<div class="outline-text-2" id="text-7">
<p>
Still trying to decide if this is something worth pursuing. Publicly
available sample libraries are not complete enough to recreate works
like Ravel's "Bolero" or Varese's "Ionization".
</p>
</div>
</div>
<div id="outline-container-org0078742" class="outline-2">
<h2 id="org0078742"><span class="section-number-2">8.</span> Quilting Frame Desk</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org6fe9557" class="outline-3">
<h3 id="org6fe9557"><span class="section-number-3">8.1.</span> Special edge-banding biscuits split.</h3>
</div>
</div>
<div id="outline-container-orgced6ecf" class="outline-2">
<h2 id="orgced6ecf"><span class="section-number-2">9.</span> Space Missions</h2>
<div class="outline-text-2" id="text-9">
<p>
Figured out right page. DONE.
</p>
</div>
</div>
<div id="outline-container-orgf3812ed" class="outline-2">
<h2 id="orgf3812ed"><span class="section-number-2">10.</span> David Davies</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orge956d94" class="outline-3">
<h3 id="orge956d94"><span class="section-number-3">10.1.</span> Broadcom BCG? Employee indicted for running a brothel.</h3>
</div>
<div id="outline-container-org36429e9" class="outline-3">
<h3 id="org36429e9"><span class="section-number-3">10.2.</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-org99cc41f" class="outline-3">
<h3 id="org99cc41f"><span class="section-number-3">10.3.</span> Next hearing 4/5/2022.</h3>
</div>
</div>
<div id="outline-container-orgc505b11" class="outline-2">
<h2 id="orgc505b11"><span class="section-number-2">11.</span> Peter Kim</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org57dd61f" class="outline-3">
<h3 id="org57dd61f"><span class="section-number-3">11.1.</span> Broadcom CSG Employee indicted for trade secret theft.</h3>
</div>
<div id="outline-container-orga3a54ee" class="outline-3">
<h3 id="orga3a54ee"><span class="section-number-3">11.2.</span> United States v. Kim (5:21-cr-00438).</h3>
</div>
<div id="outline-container-org4e3d560" class="outline-3">
<h3 id="org4e3d560"><span class="section-number-3">11.3.</span> Change of Plea Hearing set for 5/31/2022</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-10-28 Sat 04:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>